# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documnetation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd

In [4]:
# Create a series of three different colours
colors = pd.Series(["Green", "Blue", "Red"])

In [5]:
# View the series of different colours
colors

0    Green
1     Blue
2      Red
dtype: object

In [6]:
# Create a series of three different car types and view it
cars = pd.Series(["BMW", "Mercedez-Benz", "Audi"])

In [7]:
# Combine the Series of cars and colours into a DataFrame
pd.concat([cars, colors], axis=1)

               0      1
0            BMW  Green
1  Mercedez-Benz   Blue
2           Audi    Red

In [8]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
url = "https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales.csv"
car_sales = pd.read_csv(url)

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [11]:
# Export the DataFrame you created to a .csv file
car_sales.to_csv("exported_car_sales", encoding='utf-8', index=False)

In [12]:
# Find the different datatypes of the car data DataFrame
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [13]:
# Describe your current car sales DataFrame using describe()
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [14]:
# Get information about your DataFrame using info()
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

What does it show you?

In [26]:
# Create a Series of different numbers and find the mean of them
numbers = pd.Series([10,20,14, 10])
numbers.mean()

13.5

In [28]:
# Create a Series of different numbers and find the sum of them
other_numbers = pd.Series([10,20,14, 10])
other_numbers.sum()

54

In [29]:
# List out all the column names of the car sales DataFrame
list(car_sales)

['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price']

In [30]:
# Find the length of the car sales DataFrame
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [31]:
# Show the first 5 rows of the car sales DataFrame
car_sales.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [32]:
# Show the first 7 rows of the car sales DataFrame
car_sales.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [33]:
# Show the bottom 5 rows of the car sales DataFrame
car_sales.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [35]:
# Use .loc to select the row at index 3 of the car sales DataFrame
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [36]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

In [37]:
# Select the "Odometer (KM)" column from the car sales DataFrame
car_sales["Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [38]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
car_sales["Odometer (KM)"].mean()

78601.4

In [45]:
# Select the rows with over 100,000 kilometers on the Odometer
over_km = car_sales.loc[car_sales["Odometer (KM)"] > 100000]
over_km

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [46]:
# Create a crosstab of the Make and Doors columns
pd.crosstab(car_sales["Make"], car_sales["Doors"])

Doors   3  4  5
Make
BMW     0  0  1
Honda   0  3  0
Nissan  0  2  0
Toyota  1  3  0

In [52]:
# Group columns of the car sales DataFrame by the Make column and find the average
groupped = car_sales.groupby(['Make']).mean()
groupped

        Odometer (KM)  Doors
Make
BMW      11179.000000   5.00
Honda    62778.333333   4.00
Nissan  122347.500000   4.00
Toyota   85451.250000   3.75

In [54]:
# Import Matplotlib and create a plot of the Odometer column
# Don't forget to use %matplotlib inline
import matplotlib.pyplot as plt
%matplotlib

Using matplotlib backend: MacOSX

In [55]:
# Create a histogram of the Odometer column using hist()
car_sales["Odometer (KM)"].hist()

In [56]:
# Try to plot the Price column using plot()
car_sales["Price"].hist()

Why didn't it work? Can you think of a solution?

You might want to search for "how to convert a pandas string columb to numbers".

And if you're still stuck, check out this [Stack Overflow question and answer on turning a price column into integers](https://stackoverflow.com/questions/44469313/price-column-object-to-int-in-pandas).

See how you can provide the example code there to the problem here.

In [59]:
# Remove the punctuation from price column
car_sales["Price (int)"] = car_sales['Price'].str.replace('[^\w\s]','')
car_sales

/var/folders/kd/5ykfzgq17bvb14zrwvphjqp80000gn/T/ipykernel_12736/207828122.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales["Price (int)"] = car_sales['Price'].str.replace('[^\w\s]','')

     Make Colour  Odometer (KM)  Doors       Price Price (int)
0  Toyota  White         150043      4   $4,000.00      400000
1   Honda    Red          87899      4   $5,000.00      500000
2  Toyota   Blue          32549      3   $7,000.00      700000
3     BMW  Black          11179      5  $22,000.00     2200000
4  Nissan  White         213095      4   $3,500.00      350000
5  Toyota  Green          99213      4   $4,500.00      450000
6   Honda   Blue          45698      4   $7,500.00      750000
7   Honda   Blue          54738      4   $7,000.00      700000
8  Toyota  White          60000      4   $6,250.00      625000
9  Nissan  White          31600      4   $9,700.00      970000

In [60]:
# Check the changes to the price column
car_sales

     Make Colour  Odometer (KM)  Doors       Price Price (int)
0  Toyota  White         150043      4   $4,000.00      400000
1   Honda    Red          87899      4   $5,000.00      500000
2  Toyota   Blue          32549      3   $7,000.00      700000
3     BMW  Black          11179      5  $22,000.00     2200000
4  Nissan  White         213095      4   $3,500.00      350000
5  Toyota  Green          99213      4   $4,500.00      450000
6   Honda   Blue          45698      4   $7,500.00      750000
7   Honda   Blue          54738      4   $7,000.00      700000
8  Toyota  White          60000      4   $6,250.00      625000
9  Nissan  White          31600      4   $9,700.00      970000

In [64]:
# Remove the two extra zeros at the end of the price column
car_sales['Price (int)']  = car_sales['Price (int)'] .astype(int)
car_sales['Price (int)'] = car_sales['Price (int)'] / 100

In [65]:
# Check the changes to the Price column
car_sales["Price (int)"]

0     4000.0
1     5000.0
2     7000.0
3    22000.0
4     3500.0
5     4500.0
6     7500.0
7     7000.0
8     6250.0
9     9700.0
Name: Price (int), dtype: float64

In [32]:
# Change the datatype of the Price column to integers
# Done in above step

In [66]:
# Lower the strings of the Make column
car_sales["Make"].str.lower()

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [68]:
# Make lowering the case of the Make column permanent
car_sales["Make"]= car_sales["Make"].str.lower()

In [69]:
# Check the car sales DataFrame
car_sales

     Make Colour  Odometer (KM)  Doors       Price  Price (int)
0  toyota  White         150043      4   $4,000.00       4000.0
1   honda    Red          87899      4   $5,000.00       5000.0
2  toyota   Blue          32549      3   $7,000.00       7000.0
3     bmw  Black          11179      5  $22,000.00      22000.0
4  nissan  White         213095      4   $3,500.00       3500.0
5  toyota  Green          99213      4   $4,500.00       4500.0
6   honda   Blue          45698      4   $7,500.00       7500.0
7   honda   Blue          54738      4   $7,000.00       7000.0
8  toyota  White          60000      4   $6,250.00       6250.0
9  nissan  White          31600      4   $9,700.00       9700.0

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [86]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")
new_url = "https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales-missing-data.csv"
car_sales_missing_data = pd.read_csv(new_url)
# Check out the new DataFrame
car_sales_missing_data

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [87]:
# Fill the Odometer column missing values with the mean of the column inplace
car_sales_missing_data["Odometer"] = car_sales_missing_data['Odometer'].fillna(car_sales_missing_data['Odometer'].mean())

In [88]:
# View the car sales missing DataFrame and verify the changes
car_sales_missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500
6   Honda    NaN   92302.666667    4.0   $7,500
7   Honda   Blue   92302.666667    4.0      NaN
8  Toyota  White   60000.000000    NaN      NaN
9     NaN  White   31600.000000    4.0   $9,700

In [89]:
# Remove the rest of the missing data inplace
car_sales_missing_data = car_sales_missing_data.dropna()

In [90]:
# Verify the missing values are removed by viewing the DataFrame
car_sales_missing_data

     Make Colour       Odometer  Doors    Price
0  Toyota  White  150043.000000    4.0   $4,000
1   Honda    Red   87899.000000    4.0   $5,000
2  Toyota   Blue   92302.666667    3.0   $7,000
3     BMW  Black   11179.000000    5.0  $22,000
4  Nissan  White  213095.000000    4.0   $3,500
5  Toyota  Green   92302.666667    4.0   $4,500

We'll now start to add columns to our DataFrame.

In [92]:
# Create a "Seats" column where every row has a value of 5
car_sales_missing_data["Seats"] = 5
car_sales_missing_data

/var/folders/kd/5ykfzgq17bvb14zrwvphjqp80000gn/T/ipykernel_12736/3865570129.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_sales_missing_data["Seats"] = 5

     Make Colour       Odometer  Doors    Price  Seats
0  Toyota  White  150043.000000    4.0   $4,000      5
1   Honda    Red   87899.000000    4.0   $5,000      5
2  Toyota   Blue   92302.666667    3.0   $7,000      5
3     BMW  Black   11179.000000    5.0  $22,000      5
4  Nissan  White  213095.000000    4.0   $3,500      5
5  Toyota  Green   92302.666667    4.0   $4,500      5

In [93]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame
car_sales_missing_data["Engine Size"] = ["1.3", "4.0", "3.4", "2.8", "1.9", "4.3"]

/var/folders/kd/5ykfzgq17bvb14zrwvphjqp80000gn/T/ipykernel_12736/71855912.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_sales_missing_data["Engine Size"] = ["1.3", "4.0", "3.4", "2.8", "1.9", "4.3"]

In [94]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame
car_sales_missing_data["Price per KM"] = ""
car_sales_missing_data

/var/folders/kd/5ykfzgq17bvb14zrwvphjqp80000gn/T/ipykernel_12736/557705295.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_sales_missing_data["Price per KM"] = ""

,Make,Colour,Odometer,Doors,Price,Seats,Engine Size,Price per KM
0,Toyota,White,150043.000000,4.0,"$4,000",5,1.3,
1,Honda,Red,87899.000000,4.0,"$5,000",5,4.0,
2,Toyota,Blue,92302.666667,3.0,"$7,000",5,3.4,
3,BMW,Black,11179.000000,5.0,"$22,000",5,2.8,
4,Nissan,White,213095.000000,4.0,"$3,500",5,1.9,
5,Toyota,Green,92302.666667,4.0,"$4,500",5,4.3,

In [100]:
# Remove the last column you added using .drop()
car_sales_missing_data = car_sales_missing_data.drop(columns=['Price per KM'])

In [101]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable
shuffled_car_sales = car_sales_missing_data.sample(frac=1)

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [102]:
# Reset the indexes of the shuffled DataFrame
shuffled_car_sales.reset_index()

   index    Make Colour       Odometer  Doors    Price  Seats Engine Size
0      4  Nissan  White  213095.000000    4.0   $3,500      5         1.9
1      3     BMW  Black   11179.000000    5.0  $22,000      5         2.8
2      0  Toyota  White  150043.000000    4.0   $4,000      5         1.3
3      2  Toyota   Blue   92302.666667    3.0   $7,000      5         3.4
4      1   Honda    Red   87899.000000    4.0   $5,000      5         4.0
5      5  Toyota  Green   92302.666667    4.0   $4,500      5         4.3

Notice the index numbers have been changed to have order (start from 0).

In [105]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame
shuffled_car_sales["Odometer"] = shuffled_car_sales["Odometer"].apply(lambda x: x/1.6)
shuffled_car_sales

     Make Colour       Odometer  Doors    Price  Seats Engine Size
4  Nissan  White  133184.375000    4.0   $3,500      5         1.9
3     BMW  Black    6986.875000    5.0  $22,000      5         2.8
0  Toyota  White   93776.875000    4.0   $4,000      5         1.3
2  Toyota   Blue   57689.166667    3.0   $7,000      5         3.4
1   Honda    Red   54936.875000    4.0   $5,000      5         4.0
5  Toyota  Green   57689.166667    4.0   $4,500      5         4.3

In [106]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers
shuffled_car_sales = shuffled_car_sales.rename(columns={"Odometer": "Odometer (Miles)"})
shuffled_car_sales

     Make Colour  Odometer (Miles)  Doors    Price  Seats Engine Size
4  Nissan  White     133184.375000    4.0   $3,500      5         1.9
3     BMW  Black       6986.875000    5.0  $22,000      5         2.8
0  Toyota  White      93776.875000    4.0   $4,000      5         1.3
2  Toyota   Blue      57689.166667    3.0   $7,000      5         3.4
1   Honda    Red      54936.875000    4.0   $5,000      5         4.0
5  Toyota  Green      57689.166667    4.0   $4,500      5         4.3

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.